A hint, for example if I configure everything using TF and then remove everything from the UI, when I run apply again I would expect all objects to be created again. This is done for most of the object e.g.:
```
  # module.sdwan.sdwan_transport_wan_vpn_interface_ethernet_feature_associate_ipv6_tracker_feature.transport_wan_vpn_interface_ethernet_feature_associate_ipv6_tracker_feature["transport2-wan_vpn-inet_tloc_with_nat_loopback-ipv6_tracker"] will be created
  + resource "sdwan_transport_wan_vpn_interface_ethernet_feature_associate_ipv6_tracker_feature" "transport_wan_vpn_interface_ethernet_feature_associate_ipv6_tracker_feature" {
      + feature_profile_id                              = (known after apply)
      + id                                              = (known after apply)
      + transport_ipv6_tracker_feature_id               = (known after apply)
      + transport_wan_vpn_feature_id                    = (known after apply)
      + transport_wan_vpn_interface_ethernet_feature_id = "6b924eb5-6392-40fd-aa97-45baeb5458b5"
      + version                                         = (known after apply)
    }
```

However for interfaces I see it's modified, not created again. Modification will fail as object is not existing any more.
```
  # module.sdwan.sdwan_transport_wan_vpn_interface_ethernet_feature.transport_wan_vpn_interface_ethernet_feature["transport2-wan_vpn-inet_tloc_with_nat_pool"] will be updated in-place
  ~ resource "sdwan_transport_wan_vpn_interface_ethernet_feature" "transport_wan_vpn_interface_ethernet_feature" {
      ~ feature_profile_id            = "d68dee23-f2ba-4b88-bf34-528a652e994a" -> (known after apply)
        id                            = "982204f9-1761-42a1-9f88-991251fccb0b"
        name                          = "inet_tloc_with_nat_pool"
      ~ transport_wan_vpn_feature_id  = "a275ac59-bd2e-4642-80b5-5f5a894eb0a0" -> (known after apply)
      ~ version                       = 0 -> (known after apply)
        # (18 unchanged attributes hidden)
    }
```